
#include <iostream>

/*
                        Вариант 3

        Даны два множества точек на плоскости.
        Выбрать три различные точки первого множества так, чтобы круг, ограниченный окружностью,
            проходящей через эти три точки, содержал все точки второго множества и имел минимальную площадь. 
*/


/*
                        Вариант 18 

    На плоскости заданы множество точек и окружность радиусом R с центром в начале координат.
    Построить множество всех треугольников с вершинами в заданных точках, все три стороны которых пересекаются с окружностью, и найти среди них треугольник с минимальной площадью.
*/


int main()
{
    std::cout << "Hello World!\n";
}
